<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest Lexmark Universal Print Driver - Color version.</string>
	<key>Identifier</key>
	<string>com.github.codeskipper.download.LexmarkUniversalDriverColor</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>LexmarkUniversalDriverColor</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.3.1</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>URLTextSearcher</string>
			<key>Arguments</key>
			<dict>
				<key>url</key>
				<string>https://www.lexmark.com/en_us/support/universal-print-driver.html</string>
				<key>re_pattern</key>
				<string>(?P&lt;DYNAMIC_URL&gt;//downloads\.lexmark\.com/downloads/drivers/Lexmark_UC1_PrinterSoftware_\d+.dmg)</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>URLDownloader</string>
			<key>Arguments</key>
			<dict>
				<key>url</key>
				<string>https:%DYNAMIC_URL%</string>
				<key>filename</key>
				<string>%NAME%.dmg</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>CodeSignatureVerifier</string>
			<key>Arguments</key>
			<dict>
				<key>input_path</key>
				<string>%pathname%/Universal_Color_Print.pkg</string>
				<key>expected_authority_names</key>
				<array>
					<string>Developer ID Installer: Lexmark International, Inc. (4LM6P3D4A4)</string>
					<string>Developer ID Certification Authority</string>
					<string>Apple Root CA</string>
				</array>
			</dict>
		</dict>
	</array>
</dict>
</plist>
