<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest Lexmark Universal Print Driver - Color version and imports into Munki.</string>
	<key>Identifier</key>
	<string>com.github.codeskipper.munki.LexmarkPrinterSoftware</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>LexmarkPrinterSoftwareUC1</string>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>Lexmark</string>
		<key>MUNKI_CATEGORY</key>
		<string>IT</string>
		<key>pkginfo</key>
		<dict>
			<key>catalogs</key>
			<array>
				<string>testing</string>
			</array>
			<key>category</key>
			<string>%MUNKI_CATEGORY%</string>
			<key>description</key>
			<string>The Lexmark Universal Print Driver provide users and administrators with a standardized, one-driver solution for their printing needs. Instead of installing and managing individual drivers for each printer model, administrators can install the Lexmark Universal Print Driver for use with a variety of both mono and color laser printers and multi-function devices.</string>
			<key>developer</key>
			<string>Lexmark International, Inc.</string>
			<key>display_name</key>
			<string>Lexmark Universal Printer Software - Color</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>unattended_install</key>
			<true/>
			<key>unattended_uninstall</key>
			<true/>
		</dict>
	</dict>
	<key>MinimumVersion</key>
	<string>0.2.0</string>
	<key>ParentRecipe</key>
	<string>com.github.codeskipper.download.LexmarkPrinterSoftware</string>
	<key>Process</key>
    <array>
		<dict>
			<key>Processor</key>
			<string>MunkiImporter</string>
			<key>Arguments</key>
			<dict>
				<key>munkiimport_pkgname</key>
				<string>Universal_Color_Print.pkg</string>
				<key>pkg_path</key>
				<string>%pathname%</string>
				<key>repo_subdirectory</key>
				<string>%MUNKI_REPO_SUBDIR%</string>
			</dict>
		</dict>
	</array>
</dict>
</plist>
