Comment: |
    2024-06-20 - recipe deprecated due to product name change by Microsoft, new product is just Teams.
    2024-02-22 - needed to change the NAME to skip the parenthesis in (work or school) to avoid upload error to WS1 UEM
Description: Creates a munki package for Microsoft Teams (work or school), and imports it into WorkSpace ONE UEM.
Identifier: com.github.codeskipper.ws1.Microsoft Teams work or school
ParentRecipe: com.github.dataJAR-recipes.munki.Microsoft Teams work or school
MinimumVersion: '2.3'

Input:
  NAME: Microsoft Teams - work or school
  DISPLAY_NAME: Microsoft Teams (work or school)
  MUNKI_REPO_SUBDIR: apps/Microsoft
  MUNKI_CATEGORY: Productivity

  pkginfo:
    catalogs:
    - testing
    category: Productivity
    developer: Microsoft
    description: |
      Get more done with Microsoft Teams (work or school).
      Your modern workplace at home, in the office, and on the go.
    display_name: '%DISPLAY_NAME%'
    name: '%NAME%'
    notes: |
        2024-06-20 - recipe deprecated due to product name change by Microsoft, new product is just Teams.
        2024-02-22 - needed to change the NAME to skip the parenthesis in (work or school) to avoid upload error to WS1 UEM
    unattended_install: true
    unattended_uninstall: true

  # WS1 specific input,  secrets
  WS1_OAUTH_CLIENT_ID: OAUTH2_CLIENT_ID_HERE
  WS1_OAUTH_CLIENT_SECRET: OAUTH2_CLIENT_CLIENT_SECRET_HERE
  WS1_OAUTH_TOKEN_URL: OAUTH2_ACCESS_TOKEN_SERVER_URL_HERE
  WS1_API_USERNAME: API_USERNAME_HERE
  WS1_API_PASSWORD: API_PASSWORD_HERE
  WS1_API_TOKEN: API_TOKEN_HERE
  WS1_B64ENCODED_API_CREDENTIALS: B64ENCODED_API_CREDENTIALS_HERE
  WS1_API_URL: WORKSPACEONE_API_URL_HERE
  WS1_CONSOLE_URL: WORKSPACEONE_CONSOLE_URL_HERE
  WS1_GROUPID: GROUP_ID_HERE
  WS1_SMART_GROUP_NAME: SMART_GROUP_NAME_HERE
  WS1_PUSH_MODE: PUSH_MODE_SETTING

Process:
- Processor: com.github.codeskipper.VMWARE-WorkSpaceOneImporter/WorkSpaceOneImporter
  Arguments:
    ws1_oauth_client_id: '%WS1_OAUTH_CLIENT_ID%'
    ws1_oauth_client_secret: '%WS1_OAUTH_CLIENT_SECRET%'
    ws1_oauth_token_url: '%WS1_OAUTH_TOKEN_URL%'
    ws1_api_token: '%WS1_API_TOKEN%'
    ws1_api_username: '%WS1_API_USERNAME%'
    ws1_api_password: '%WS1_API_PASSWORD%'
    ws1_b64encoded_api_credentials: '%WS1_B64ENCODED_API_CREDENTIALS%'
    ws1_api_url: '%WS1_API_URL%'
    ws1_console_url: '%WS1_CONSOLE_URL%'
    ws1_groupid: '%WS1_GROUPID%'
    ws1_smart_group_name: '%WS1_SMART_GROUP_NAME%'
    ws1_push_mode: '%WS1_PUSH_MODE%'


