Comment: |
  recipe with ws1_assignments for AppsV2 API style assignment-rules
  See https://as135.awmdm.com/API/help/#!/apis/10001?!%2FAppsV2%2FAppsV2_UpdateAssignmentRuleAsync
Description: Creates a munki package for Company Portal, and imports it into WorkSpace ONE.
Identifier: com.github.codeskipper.ws1.CompanyPortal
ParentRecipe: com.github.jlehikoinen.munki.CompanyPortal
MinimumVersion: '2.3'

Input:
  NAME: Microsoft Company Portal
  DISPLAY_NAME: '%NAME%'
  pkginfo:
    catalogs:
    - testing
    description: The Microsoft Company Portal provides access to corporate apps and resources
      from almost any network. Your company must already subscribe to Microsoft Intune,
      and your IT admin must set up your account before you can use this app.
    display_name: '%DISPLAY_NAME%'
    name: '%NAME%'
    unattended_install: true
    unattended_uninstall: true


  # WS1 specific input,  secrets
  WS1_OAUTH_CLIENT_ID: OAUTH2_CLIENT_ID_HERE
  WS1_OAUTH_CLIENT_SECRET: OAUTH2_CLIENT_CLIENT_SECRET_HERE
  WS1_OAUTH_TOKEN_URL: OAUTH2_ACCESS_TOKEN_SERVER_URL_HERE
  WS1_API_USERNAME: API_USERNAME_HERE
  WS1_API_PASSWORD: API_PASSWORD_HERE
  WS1_API_TOKEN: API_TOKEN_HERE
  WS1_B64ENCODED_API_CREDENTIALS: B64ENCODED_API_CREDENTIALS_HERE
  WS1_API_URL: WORKSPACEONE_API_URL_HERE
  WS1_CONSOLE_URL: WORKSPACEONE_CONSOLE_URL_HERE
  WS1_GROUPID: GROUP_ID_HERE
  WS1_SMART_GROUP_NAME: SMART_GROUP_NAME_HERE
  WS1_PUSH_MODE: PUSH_MODE_SETTING

  # WS1 - testing new AppsV2 assignments feature
  ws1_app_assignments:
      - distribution:
          name: ASSIGNMENT_NAME
          description: ASSIGNMENT_DESCRIPTION
          smart_group_names:
            - SMART_GROUP_NAME1
            - SMART_GROUP_NAME2
          app_delivery_method: AUTO_OR_ON_DEMAND
          distr_delay_days: DISTRIBUTION_DELAY_DAYS
          display_in_app_catalog: true
          is_default_assignment: false
          keep_app_updated_automatically: true
        restriction:
            remove_on_unenroll: false
            managed_access: false
            desired_state_management: false
            prevent_removal: false

Process:
- Processor: com.github.codeskipper.VMWARE-WorkSpaceOneImporter/WorkSpaceOneImporter
  Arguments:
    ws1_oauth_client_id: '%WS1_OAUTH_CLIENT_ID%'
    ws1_oauth_client_secret: '%WS1_OAUTH_CLIENT_SECRET%'
    ws1_oauth_token_url: '%WS1_OAUTH_TOKEN_URL%'
    ws1_api_token: '%WS1_API_TOKEN%'
    ws1_api_username: '%WS1_API_USERNAME%'
    ws1_api_password: '%WS1_API_PASSWORD%'
    ws1_b64encoded_api_credentials: '%WS1_B64ENCODED_API_CREDENTIALS%'
    ws1_api_url: '%WS1_API_URL%'
    ws1_console_url: '%WS1_CONSOLE_URL%'
    ws1_groupid: '%WS1_GROUPID%'
    ws1_smart_group_name: '%WS1_SMART_GROUP_NAME%'
    ws1_push_mode: '%WS1_PUSH_MODE%'
